notes/Theory/ThoeryEdNotes.org
#+AUTHOR: Jeffrey Young
#+TITLE: Primer on Educational Theoretical Underpinnings
#+DATE: Mar 30, 2017

# Fix the margins
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{bussproofs}
#+LATEX_CMD: pdflatex

# Remove section numbers, no table of contents
#+OPTIONS: toc:nil
#+options: num:nil

# Set the article class
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [10pt, letterpaper]

* Orientation
  In the Educational theory literature we are after what is called a /typology of explanation/ several exist and have been developed through the years see this paper cite:brown1984explaining for an overview. This document serves as a one stop shop of sorts for useful papers, summaries or primers on said papers. If you don't have time I suggest just reading the Purpose section and the section on Bellack.
* Executive Summary
  We want to be focusing on Bellack's work for sure. In their research they develop a coding system, that describes qualities of in classroom lectures, and then they use that coding system to determine /teaching cycles/ which are patterns they noticed that arose from the data. We can and should co-opt their coding strategies and recode our data, this may also open the door to analyzing verbal lectures. What you find in this document is a summary of chapter two, where they layout the system. I'm working on reformulating our system in terms of theirs I'll post it when its finished. The big question in my mind is how this will help or connect to a DSL.

* Purpose
   Most of the papers I've found have developed a typology, then performed a experimental study of some sort, and then performed some statistical analysis to determine significance between some control group and some other group, typically a chi-squared test. The purpose of this document is to serve as a reference point for papers that may be interesting and to summarize those papers in terms that will be useful. I see two major roads that we can go down based on these papers: 1) We can develop our own typology, specifically designed to explicate and elucidate explanatory objects whose purpose is to explain algorithms - this is an extension of what we've already done. The end of this branch, in my mind, is a user study similar to what some researchers in this area have done with lectures (see Rosenshine below), this would allow us to say these categories are important, these arent' and so on. The other path I can envision is to recodify our methods in terms of these researchers methods, specifically in terms of Bellack et al 1966. I think the latter route (a la Bellack) is the most promising, I can envision writing two papers regarding their work 1) Appropriating their system to our needs and show that it can aid in the creation of a DSL or is useful for computer science educators 2) Using the system to encode documents and crunching the data much like we were doing.
  
* Papers that will be useful or relevant 

** Papers that detail what good explanations are 
   - Brown and Armstrong: Explaining and Explanations cite:brown1984explaining 
   2. Smith and Meux 1970
   3. Thyne 1963; 1968; The Psychology of Learning and Techniques of Teaching cite:thyne1965psychology 
   4. Turney et al., 1975
   5. Gage and Berliner 1975; Research into Classroom Processes   
   6. Brown 1978a, 1978b; Microteaching: Programme of Teaching Skills cite:10.2307/3120386   
      
** Papers that detail different Typography's of Explanations 
   -  Swift 1967, Language and Concepts in Teaching cite:smith1967language  
   -  Bellack et al, The Language of the classroom cite:bellack1966language 
   -  Ennis 1969, Logic in Teaching cite:ennis1969logic 
   - Smith and Meux: Study in the logic of teaching cite:Smith1970-SMIASO-13 
   -  Hyman 1974: Vantage Points for Study cite:hyman1968teaching 

     
* Bellack Language of the Classroom 

** Chapter 2: Basic System For Analysis 

*** Overview
    To analyze classroom discourse Bellack et al. developed a "system of categories devised to describe the verbal performance of teachers and students". Protocols of classroom discourse were analyzed in terms of these categories. Basically, and probably unbeknownst to them, they developed a programming language that describes classroom discourse. Keep in mind that their data is based off of transcripts of lectures, so their coding scheme naturally reflects that. In this section I'm going to explicate, in detail, their system. I'll start with a quick overview, then define the semantics of each of their terminals, and then dive deep into a few so you can see some examples and explore some of the mechanics. If you don't have time just read "The System", "Grammar", "Semantics"
*** The System 
    This system is heavily based on Wittgenstein's concept of a language game. The basic categories are:
    - Pedagogical Moves \triangleq classroom discourse is viewed as a kind of "language game" (this is a technical term from Wittgenstein, specifically late-Wittgenstein, I can give you a run down later but suffice to say that the "door depends upon the hinge - Wittgenstein in /On Certaintly/"). The basic unit of discourse is deemed a "pedagogical move" in this system. There are four types of pedagogical moves in the system:
      1. Structuring
      2. Soliciting
      3. Responding
      4. Reacting 
    - Teaching Cycles \triangleq Pedagogical moves occur in classroom discourse in certain cyclical patterns and combinations that are designated teach cycles.
    - Categories of Meaning \triangleq Four functionally different types of meaning are communicated by teachers and pupils in the classroom:
      1. Substantive with associated
      2. Substantive-logical meanings
      3. instructional with associated
      4. instructional-logical meanings
    Coding is done from the viewpoint of the observer, with pedagogical meaning inferred from the speaker's verbal behavior. 
*** Grammar
    Each pedagogical move is coded as follows, I've added indices to follow the text: \\
    \begin{verbatim}
    Move = 1. Speaker 
           | 2. Type of Move 
           | 3. Substantive Meaning
           | 4. Substantive-Logical Meanings 
           | 5. Number of Lines in (3) or (4) 
           | 6. Instructional Meanings 
           | 7. Instructional-Logical Meanings 
           | 8. Number of lines in (6) or (7) 
    \end{verbatim}

*** Semantics

