notes/Theory/ThoeryEdNotes.org
**** *Semantic of Moves:* 
     I'll elucidate the meaning of each move, I'll maintain the indices from the Grammar to avoid confusion. These will be brief definitions, for something more fleshed out and  with much more detail see the latter sections, specifically the "Categories of Meaning" Section:
     1. *Speaker* \triangleq Indicates the source of the utterance, is one of:
        1. /Teacher/ (T)
        2. /Pupil/ (P)
        3. /Audio-Visual Device/ (A)
     2. *Type of Pedagogical Move* \triangleq reference to function of move, there are 2 types each with sub-types:
        1. Initiatory Moves
           1. /Structuring/ (STR) \triangleq sets context for subsequent behavior by launching or halting-excluding interaction.
           2. /Soliciting/ (SOL) \triangleq directly elicits a verbal, physical, or mental response; coded in terms of response expected. 
       2. Reflexive Moves
          1. /Responding/ (RES) \triangleq fulfills expectation of solicitation; bears reciprocal relation only to solicitation. 
          2. /Reacting/ (REA) \triangleq modifies (by clarifying, synthesizing, expanding) and/or rates (positively or negatively); occasioned by previous move, but not directly elicited; reactions to more than one previous move coded in italics like this /REA/ 
       3. /Not Codable/ (NOC) \triangleq serves as the \perp in their coding scheme.
     3. *Substantive Meaning* \triangleq reference to a subject matter topic 
     4. *Substantive-Logical Meaning* \triangleq reference to cognitive process involved in dealing with subject matter under study. 3 Main Types each with subtypes:
        1. Analytic Process \triangleq Use of language or established rules of logic
           1. /Definining-Denotative/ (DED) \triangleq object referent of term 
           2. /Defining-Connotative/ (DEC) \triangleq defining characteristics of class or term
           3. /Interpreting/ (INT) \triangleq verbal equivalent of a statement, slogan, aphorism, or proverb
        2. Empirical Process \triangleq sense experience as criterion of truth
           1. /Fact-Stating/ (FAC) \triangleq what is, was, or will be without explanation or evaluation.
           2. /Explaining/ (XPL) \triangleq relation between objects, events, principles, conditional inference, cause-effect, explicit comparison-contrast, statement of principles, theories or laws
        3. Evaluative Process \triangleq set of criteria or value system as basis for verification
           1. /Opining/ (OPN) \triangleq personal values for statement of policy, judgment or evaluation of event, idea, state of affairs, direct and indirect evaluation included
           2. /Justifying/ (JUS) \triangleq reasons or argument for or against opinion or judgment
        4. /Logical Process Not Clear/ (NCL) \triangleq this serves as \perp for Substantive-Logical Meanings
     5. *Number of Lines in 3 and 4 above* 
     6. *Instructional Meanings* \triangleq reference to factors related to classroom management
        1. /Assignment/ (ASG) \triangleq suggested or required student activity; reports, tests, readings etc.
        2. /Material/ (MAT) \triangleq teaching aids and instructional devices
        3. /Person/ (PER) \triangleq person as physical object or personal experiences
        4. /Procedure/ (PRC) \triangleq Plan of activities or a course of action
        5. /Statement/ (STA) \triangleq Verbal utterance, particularly the meaning validity, truth, or propriety of an utterance
        6. /Logical Process/ (LOG) \triangleq Function of language or rule of logic; reference to definitions or arguments, but not presentation of such
        7. /Action-General/ (ACT) \triangleq performance (vocal, non-vocal, cognitive, or emotional) the specific nature of which is uncertain or complex
        8. /Action-Vocal/ (ACV) \triangleq physical qualities of vocal action
        9. /Action-Physical/ (ACP) \triangleq physical movement or process
        10. /Action-Cognitive/ (ACC) \triangleq Cognitive process, but not the language or logic of a specific utterance; thinking, knowing, understanding, or listening
        11. /Action-Emotional/ (ACE) \triangleq emotion or feeling, but not expression of attitude or value
        12. /Language Mechanics/ (LAM) \triangleq the rules of grammar and/or usage
     7. *Instructional-Logic Meaning* \triangleq reference to cognitive processes related to the distinctly didactic verbal moves in the instructional situation
        1. Analytic Process: see (4) above
        2. Empirical Process: see (4) above
        3. Evaluative Process: includes the definitions in (4) above and:
           1. Rating \triangleq reference to metacommunication; usually an evaluative reaction (REA)
              1. /Positive/ (POS) \triangleq distinctly affirmative rating
              2. /Admitting/ (ADM) \triangleq mild or equivocally positive rating
              3. /Repeating/ (RPT) \triangleq implicit positive rating when statement (STA) is repeated by another speacker; also for SOL to repeat a vocal action (ACV)
              4. /Qualifying/ (QAL) \triangleq explicit reservation stated in rating; exception
              5. /Not Admitting/ (NAD) \triangleq rating that rejects by stating the contrary; a direct refutation
              6. /Negative/ (NEG) \triangleq distinctly negative rating
              7. /Positive/Negative/ (PON) \triangleq SOL requesting positive or negative rating
              8. /Admitting/Not Admitting/ (AON) \triangleq SOL asking to permit or not permit specific action
           2. Extra-logical Process \triangleq SOL expecting physical action or when logical nature of verbal response cannot be determined. 
              1. /Performing/ (PRF) \triangleq asking, demanding; explicit directive or imperative
              2. /Directing/ (DIR) \triangleq SOL with or without stated alternatives; asking for directive, not permision for specific action 
              3. /Extra-logical Process Not Clear/ (NCL) \triangleq \perp for extra-logical process
     8. *Number of Lines in 6 and 7 above*

**** The / Operator
     Moves are syntactically conjoined into strings with the "/" operator: \\
     \begin{equation}
        \(\frac{n \in \text{Move} \quad m \in \text{Move}}{n/m \in \text{Move}}\)
     \end{equation}
**** An Example Sentence
     An example, coded pedagogical move is: \\
     \begin{verbatim}
       T/STR/IMX/XPL/4/PRC/FAC/2
     \end{verbatim}
     The interpretation is as follows:
     \begin{verbatim}
       T / STR / IMX / XPL /  4  / PRC / FAC / 2
      (1)/ (2) / (3) / (4) / (5) / (6) / (7) /(8)
     \end{verbatim}
     This translates to: A /teacher/ (1) makes a /structuring/ (2) move in which they /explain/ (4) something about  /imports and exports/ (3) for /four/ (5) lines of transcript and also states /facts/ (7) about class /procedures/ (6) for /two/ (8) lines of the transcript. 
