notes/Theory/ThoeryEdNotes.tex

\subsubsection*{Semantics}
\label{sec:org10a0172}

\begin{itemize}
\item \textbf{Semantic of Moves:}
\label{sec:org7f00cd3}
I'll elucidate the meaning of each move, I'll maintain the indices from the Grammar to avoid confusion. These will be brief definitions, for something more fleshed out and  with much more detail see the latter sections, specifically the "Categories of Meaning" Section:
\begin{enumerate}
\item \textbf{Speaker} \(\triangleq\) Indicates the source of the utterance, is one of:
\begin{enumerate}
\item \emph{Teacher} (T)
\item \emph{Pupil} (P)
\item \emph{Audio-Visual Device} (A)
\end{enumerate}
\item \textbf{Type of Pedagogical Move} \(\triangleq\) reference to function of move, there are 2 types each with sub-types:
\begin{enumerate}
\item Initiatory Moves
\begin{enumerate}
\item \emph{Structuring} (STR) \(\triangleq\) sets context for subsequent behavior by launching or halting-excluding interaction.
\item \emph{Soliciting} (SOL) \(\triangleq\) directly elicits a verbal, physical, or mental response; coded in terms of response expected.
\end{enumerate}
\end{enumerate}
\begin{enumerate}
\item Reflexive Moves
\begin{enumerate}
\item \emph{Responding} (RES) \(\triangleq\) fulfills expectation of solicitation; bears reciprocal relation only to solicitation.
\item \emph{Reacting} (REA) \(\triangleq\) modifies (by clarifying, synthesizing, expanding) and/or rates (positively or negatively); occasioned by previous move, but not directly elicited; reactions to more than one previous move coded in italics like this \emph{REA}
\end{enumerate}
\item \emph{Not Codable} (NOC) \(\triangleq\) serves as the \(\perp\) in their coding scheme.
\end{enumerate}
\item \textbf{Substantive Meaning} \(\triangleq\) reference to a subject matter topic
\item \textbf{Substantive-Logical Meaning} \(\triangleq\) reference to cognitive process involved in dealing with subject matter under study. 3 Main Types each with subtypes:
\begin{enumerate}
\item Analytic Process \(\triangleq\) Use of language or established rules of logic
\begin{enumerate}
\item \emph{Definining-Denotative} (DED) \(\triangleq\) object referent of term
\item \emph{Defining-Connotative} (DEC) \(\triangleq\) defining characteristics of class or term
\item \emph{Interpreting} (INT) \(\triangleq\) verbal equivalent of a statement, slogan, aphorism, or proverb
\end{enumerate}
\item Empirical Process \(\triangleq\) sense experience as criterion of truth
\begin{enumerate}
\item \emph{Fact-Stating} (FAC) \(\triangleq\) what is, was, or will be without explanation or evaluation.
\item \emph{Explaining} (XPL) \(\triangleq\) relation between objects, events, principles, conditional inference, cause-effect, explicit comparison-contrast, statement of principles, theories or laws
\end{enumerate}
\item Evaluative Process \(\triangleq\) set of criteria or value system as basis for verification
\begin{enumerate}
\item \emph{Opining} (OPN) \(\triangleq\) personal values for statement of policy, judgment or evaluation of event, idea, state of affairs, direct and indirect evaluation included
\item \emph{Justifying} (JUS) \(\triangleq\) reasons or argument for or against opinion or judgment
\end{enumerate}
\item \emph{Logical Process Not Clear} (NCL) \(\triangleq\) this serves as \(\perp\) for Substantive-Logical Meanings
\end{enumerate}
\item \textbf{Number of Lines in 3 and 4 above}
\item \textbf{Instructional Meanings} \(\triangleq\) reference to factors related to classroom management
\begin{enumerate}
\item \emph{Assignment} (ASG) \(\triangleq\) suggested or required student activity; reports, tests, readings etc.
\item \emph{Material} (MAT) \(\triangleq\) teaching aids and instructional devices
\item \emph{Person} (PER) \(\triangleq\) person as physical object or personal experiences
\item \emph{Procedure} (PRC) \(\triangleq\) Plan of activities or a course of action
\item \emph{Statement} (STA) \(\triangleq\) Verbal utterance, particularly the meaning validity, truth, or propriety of an utterance
\item \emph{Logical Process} (LOG) \(\triangleq\) Function of language or rule of logic; reference to definitions or arguments, but not presentation of such
\item \emph{Action-General} (ACT) \(\triangleq\) performance (vocal, non-vocal, cognitive, or emotional) the specific nature of which is uncertain or complex
\item \emph{Action-Vocal} (ACV) \(\triangleq\) physical qualities of vocal action
\item \emph{Action-Physical} (ACP) \(\triangleq\) physical movement or process
\item \emph{Action-Cognitive} (ACC) \(\triangleq\) Cognitive process, but not the language or logic of a specific utterance; thinking, knowing, understanding, or listening
\item \emph{Action-Emotional} (ACE) \(\triangleq\) emotion or feeling, but not expression of attitude or value
\item \emph{Language Mechanics} (LAM) \(\triangleq\) the rules of grammar and/or usage
\end{enumerate}
\item \textbf{Instructional-Logic Meaning} \(\triangleq\) reference to cognitive processes related to the distinctly didactic verbal moves in the instructional situation
\begin{enumerate}
\item Analytic Process: see (4) above
\item Empirical Process: see (4) above
\item Evaluative Process: includes the definitions in (4) above and:
\begin{enumerate}
\item Rating \(\triangleq\) reference to metacommunication; usually an evaluative reaction (REA)
\begin{enumerate}
\item \emph{Positive} (POS) \(\triangleq\) distinctly affirmative rating
\item \emph{Admitting} (ADM) \(\triangleq\) mild or equivocally positive rating
\item \emph{Repeating} (RPT) \(\triangleq\) implicit positive rating when statement (STA) is repeated by another speacker; also for SOL to repeat a vocal action (ACV)
\item \emph{Qualifying} (QAL) \(\triangleq\) explicit reservation stated in rating; exception
\item \emph{Not Admitting} (NAD) \(\triangleq\) rating that rejects by stating the contrary; a direct refutation
\item \emph{Negative} (NEG) \(\triangleq\) distinctly negative rating
\item \emph{Positive/Negative} (PON) \(\triangleq\) SOL requesting positive or negative rating
\item \emph{Admitting/Not Admitting} (AON) \(\triangleq\) SOL asking to permit or not permit specific action
\end{enumerate}
\item Extra-logical Process \(\triangleq\) SOL expecting physical action or when logical nature of verbal response cannot be determined. 
\begin{enumerate}
\item \emph{Performing} (PRF) \(\triangleq\) asking, demanding; explicit directive or imperative
\item \emph{Directing} (DIR) \(\triangleq\) SOL with or without stated alternatives; asking for directive, not permision for specific action
\item \emph{Extra-logical Process Not Clear} (NCL) \(\triangleq\) \(\perp\) for extra-logical process
\end{enumerate}
\end{enumerate}
\end{enumerate}
\item \textbf{Number of Lines in 6 and 7 above}
\end{enumerate}

\item The / Operator:
\label{sec:org8983dde}
The Moves constituents are syntactically conjoined into strings with the "/" operator in order: \\
\begin{equation}
   \(\frac{n \in \text{Move Constituent} \quad m \in \text{Move Constituent}}{n/m \in \text{Partial Move}}\)
\end{equation}
\item An Example Sentence
\label{sec:org902ce50}
coded pedagogical move is: \\
\begin{verbatim}
  T/STR/IMX/XPL/4/PRC/FAC/2
\end{verbatim}
The interpretation is as follows:
\begin{verbatim}
  T / STR / IMX / XPL /  4  / PRC / FAC / 2
 (1)/ (2) / (3) / (4) / (5) / (6) / (7) /(8)
\end{verbatim}
This translates to: A \emph{teacher} (1) makes a \emph{structuring} (2) move in which they \emph{explain} (4) something about  \emph{imports and exports} (3) for \emph{four} (5) lines of transcript and also states \emph{facts} (7) about class \emph{procedures} (6) for \emph{two} (8) lines of the transcript. 
\item Structuring (STR)
\label{sec:org3d2ba4b}
\begin{itemize}
