notes/Theory/ThoeryEdNotes.org
**** Structuring (STR) 
     - _Purpose_: \\
      Structuring moves function to /set the context/ for subsequent behavior. Think of this as identifying, setting, or initializing the state. 
     - _Mechanics_: This is achieved by:
      1. Launching or Halting or Exluding interactions bewteen teacher and pupils
      2. Indicating the nature of the interaction in terms of the dimensions of time, agent, activity, topic and cognitive process, regulations, reasons, and instructional aid.
     - _Response_: Structuring moves do not elicit a response, are not direct responses and are not called out by anything in particular in the classroom 
     - _Examples_:
       1. T/STR: All right, getting down to it now, I think international trade, then, or international economic relations, whatever you call it, is a field of study within economics which in many cases has been unfortunately divorced from or too far divorced from domestic trade because there are great similarities, and also there are some rather distinct differences.
**** Soliciting (SOL)
     - _Purpose_: \\
      These are moves that tend to elicit an active verbal response, a cognitive response, or a physical response to the persons addressed.
     - _Mechanics_: Soliciting moves are encoded in terms of the response expected rather than the solicitation itself 
     - _Examples_:
       1. T/SOL: What are the factors of production?
       2. P/SOL: May we keep our books open?
       3. T/SOL: Pay attention to this!
**** Responding (RES)
     - _Purpose_: \\
      These moves are reciprocal to soliciting moves and only occur in relation to them. They function to fulfill the expectation of soliciting moves, and as such are reflexive.
     - _Mechanics_: There can be no solicitation that is not intended to elicit a response, and no response that has not been directly elicited by a solicitation
     - _Examples_:
       1. T/SOl: What are the factors of production?
          P/RES: Land, Labor, and capital.
       2. T/SOL: What is exchange control
          P/Res: I don't know
**** Reacting (REA)
     - Purpose: \\
      These moves are occasioned by a structuring, soliciting, responding, or some prior move but are not directly elicited by them. These qualify the moves that preceded them, either by clarifying some point, synthesizing a new one, or expanding on a previous point. 
     - _Mechanics_: Preceding moves /only/ serve as the occasion for reaction moves. 
     - _Examples_:
       1. T/REA: All right
       2. T/REA: That's partly it
       3. T/REA: Good. It limits specifically the number of items of one type or another which can come into this country. For example, we might decide that no more than one thousand German cars will be imported in any one calendar year. This is a specific quota which the government checks.
    - _Special Modifiers_: When a reaction move is italicized (/REA/); this denotes that the reaction is occasioned by more than a single move.
     - _Special Modifier Examples_:
       1. T/REA: All of the instances of foreign investment that we have discussed here can be classified as either direct or portfolio types of investment.
                    
*** Teaching Cycles
    Pedagogical moves occur in cyclical patterns and combinations, which are designated as /teaching cycles/. A cycle begins with a structuring move or a solicitation that is not preceded by a structuring move. A cycle ends with the move that precedes a new cycle. Teaching cycles are coded /only after/ all moves have been coded. These define structuring and soliciting moves as /initiatory/ and responding and reacting moves as /reflexive/. There are 21 types of teaching cycles possible. The first 12 are structure-initiated and the last 9 are initiated by soliciting moves. 

**** Types of Teaching Cycles
     1. STR
     2. STR SOL
     3. STR REA
     4. STR REA REA \ldots
     5. STR SOL RES
     6. STR SOL RES RES \ldots
     7. STR SOL REA
     8. STR SOL REA REA \ldots
     9. STR SOL RES REA
     10. STR SOL RES REA REA \ldots
     11. STR SOL RES REA RES \ldots
     12. STR SOL RES REA RES \ldots REA \ldots
     13. SOL
     14. SOL RES
     15. SOL RES RES \ldots
     16. SOL REA
     17. SOL REA REA \ldots
     18. SOL RES REA
     19. SOL RES REA REA \ldots
     20. SOL RES REA RES \ldots
     21. SOL RES REA RES \ldots REA \ldots
    
  Each type of teaching cycle represents a different pattern of pedagogical discourse. For example, Cycle 9, represents a pattern of discourse that is initiated by a structuring move and is followed by a solicitation; this solicitation then elicits a response that is the occasion for a reaction. Cycle 21 is initiated by a solicitation that elicits multiple responses which are in turn the occasion for multiple reactions. 
**** Purpose of Teaching Cycles:
     Teaching Cycles provide a way of describing pedagogical moves in relationship to each other. By utilizing the concept of teaching cycles it becomes possible to determine the extent to which solicitations elicit single or multiple responses or the regularity with which reactions follow responses. If a single pedagogical move may be compared to a move in chess or a single play in football. Then teaching cycles are an interrelated series of moves or plays, like a drive in football or a strategy in chess.
*** Categories of Meaning
    There are four functionally different types of /meaning/ communicated in the classroom. /substantive/ with associated /substantive-logical/ meanings, /instructional/ with associated /instructional-logical/ meanings. Within each pedagogical move these four types of meaning are identified when they appear in the discourse
**** *Substantive*
     meanings refer to the subject matter under study by the class. For example, some previous example's substantive meanings referred to a teaching unit based on /International Economic Problems/ By James Calderwood. These meanings can then be /atomized/, note that sub codings are possible as well, here are just a few examples:
     1. /Trade/ (TRA) \triangleq refers to General discussions of trade; nature of trade in broad terms.
        1. /Trade/ - /Domestic and International/ (TDI) \triangeq refers to Domestic trade compared and contrasted with international trade.
     2. /Factors of Production and/or Specialization/ (FSP) \triangleq refers to general discussion of factors of production; what they are; specialization etc. 
     3. /Barriers to Trade/ \triangleq General discussion of barriers, including policies directed toward maintaining or increasing barriers.
     4. /Not Trade/ (NTR) \triangleq Discussion not about trade or economics
     5. /Promoting Free Trade/ (PFT) \triangleq Discussions regarding the promotion of free trade
     6. /Barrer-Tariffs/ (BAT) \triangleq Specific Discussions of tariff.
