notes/Theory/ThoeryEdNotes.tex
\item \uline{Purpose}: \\
Structuring moves function to \emph{set the context} for subsequent behavior. Think of this as identifying, setting, or initializing the state.
\item \uline{Mechanics}: This is achieved by:
\begin{enumerate}
\item Launching or Halting or Exluding interactions bewteen teacher and pupils
\item Indicating the nature of the interaction in terms of the dimensions of time, agent, activity, topic and cognitive process, regulations, reasons, and instructional aid.
\end{enumerate}
\item \uline{Response}: Structuring moves do not elicit a response, are not direct responses and are not called out by anything in particular in the classroom
\item \uline{Examples}:
\begin{enumerate}
\item T/STR: All right, getting down to it now, I think international trade, then, or international economic relations, whatever you call it, is a field of study within economics which in many cases has been unfortunately divorced from or too far divorced from domestic trade because there are great similarities, and also there are some rather distinct differences.
\end{enumerate}
\end{itemize}
\item Soliciting (SOL)
\label{sec:orgff12ffb}
\begin{itemize}
\item \uline{Purpose}: \\
These are moves that tend to elicit an active verbal response, a cognitive response, or a physical response to the persons addressed.
\item \uline{Mechanics}: Soliciting moves are encoded in terms of the response expected rather than the solicitation itself
\item \uline{Examples}:
\begin{enumerate}
\item T/SOL: What are the factors of production?
\item P/SOL: May we keep our books open?
\item T/SOL: Pay attention to this!
\end{enumerate}
\end{itemize}
\item Responding (RES)
\label{sec:orgf64857b}
\begin{itemize}
\item \uline{Purpose}: \\
These moves are reciprocal to soliciting moves and only occur in relation to them. They function to fulfill the expectation of soliciting moves, and as such are reflexive.
\item \uline{Mechanics}: There can be no solicitation that is not intended to elicit a response, and no response that has not been directly elicited by a solicitation
\item \uline{Examples}:
\begin{enumerate}
\item T/SOl: What are the factors of production?
P/RES: Land, Labor, and capital.
\item T/SOL: What is exchange control
P/Res: I don't know
\end{enumerate}
\end{itemize}
\item Reacting (REA)
\label{sec:org102b42f}
\begin{itemize}
\item Purpose: \\
These moves are occasioned by a structuring, soliciting, responding, or some prior move but are not directly elicited by them. These qualify the moves that preceded them, either by clarifying some point, synthesizing a new one, or expanding on a previous point.
\item \uline{Mechanics}: Preceding moves \emph{only} serve as the occasion for reaction moves.
\item \uline{Examples}:
\begin{enumerate}
\item T/REA: All right
\item T/REA: That's partly it
\item T/REA: Good. It limits specifically the number of items of one type or another which can come into this country. For example, we might decide that no more than one thousand German cars will be imported in any one calendar year. This is a specific quota which the government checks.
\end{enumerate}
\end{itemize}
\begin{itemize}
\item \uline{Special Modifiers}: When a reaction move is italicized (\emph{REA}); this denotes that the reaction is occasioned by more than a single move.
\begin{itemize}
\item \uline{Special Modifier Examples}:
\begin{enumerate}
\item T/REA: All of the instances of foreign investment that we have discussed here can be classified as either direct or portfolio types of investment.
\end{enumerate}
\end{itemize}
\end{itemize}
\end{itemize}

\subsubsection*{Teaching Cycles}
\label{sec:org6e77596}
Pedagogical moves occur in cyclical patterns and combinations, which are designated as \emph{teaching cycles}. A cycle begins with a structuring move or a solicitation that is not preceded by a structuring move. A cycle ends with the move that precedes a new cycle. Teaching cycles are coded \emph{only after} all moves have been coded. These define structuring and soliciting moves as \emph{initiatory} and responding and reacting moves as \emph{reflexive}. There are 21 types of teaching cycles possible. The first 12 are structure-initiated and the last 9 are initiated by soliciting moves. 

\begin{itemize}
\item Types of Teaching Cycles
\label{sec:org5928c5a}
\begin{enumerate}
\item STR
\item STR SOL
\item STR REA
\item STR REA REA \ldots
\item STR SOL RES
\item STR SOL RES RES \ldots
\item STR SOL REA
\item STR SOL REA REA \ldots
\item STR SOL RES REA
\item STR SOL RES REA REA \ldots
\item STR SOL RES REA RES \ldots
\item STR SOL RES REA RES \ldots REA \ldots
\item SOL
\item SOL RES
\item SOL RES RES \ldots
\item SOL REA
\item SOL REA REA \ldots
\item SOL RES REA
\item SOL RES REA REA \ldots
\item SOL RES REA RES \ldots
\item SOL RES REA RES \ldots REA \ldots
\end{enumerate}

Each type of teaching cycle represents a different pattern of pedagogical discourse. For example, Cycle 9, represents a pattern of discourse that is initiated by a structuring move and is followed by a solicitation; this solicitation then elicits a response that is the occasion for a reaction. Cycle 21 is initiated by a solicitation that elicits multiple responses which are in turn the occasion for multiple reactions. 
\item Purpose of Teaching Cycles:
\label{sec:orgc0e47a1}
Teaching Cycles provide a way of describing pedagogical moves in relationship to each other. By utilizing the concept of teaching cycles it becomes possible to determine the extent to which solicitations elicit single or multiple responses or the regularity with which reactions follow responses. If a single pedagogical move may be compared to a move in chess or a single play in football. Then teaching cycles are an interrelated series of moves or plays, like a drive in football or a strategy in chess.
\end{itemize}
\subsubsection*{Categories of Meaning}
\label{sec:org6110fd3}
There are four functionally different types of \emph{meaning} communicated in the classroom. \emph{substantive} with associated \emph{substantive-logical} meanings, \emph{instructional} with associated \emph{instructional-logical} meanings. Within each pedagogical move these four types of meaning are identified when they appear in the discourse
\begin{itemize}
\item \textbf{Substantive}
\label{sec:org4b458cc}
meanings refer to the subject matter under study by the class. For example, some previous example's substantive meanings referred to a teaching unit based on \emph{International Economic Problems} By James Calderwood. These meanings can then be \emph{atomized}, note that sub codings are possible as well, here are just a few examples:
\begin{enumerate}
\item \emph{Trade} (TRA) \(\triangleq\) refers to General discussions of trade; nature of trade in broad terms.
\begin{enumerate}
\item \emph{Trade} - \emph{Domestic and International} (TDI) \triangeq refers to Domestic trade compared and contrasted with international trade.
\end{enumerate}
\item \emph{Factors of Production and/or Specialization} (FSP) \(\triangleq\) refers to general discussion of factors of production; what they are; specialization etc.
\item \emph{Barriers to Trade} \(\triangleq\) General discussion of barriers, including policies directed toward maintaining or increasing barriers.
\item \emph{Not Trade} (NTR) \(\triangleq\) Discussion not about trade or economics
\item \emph{Promoting Free Trade} (PFT) \(\triangleq\) Discussions regarding the promotion of free trade
\item \emph{Barrer-Tariffs} (BAT) \(\triangleq\) Specific Discussions of tariff.
\end{enumerate}
\item \textbf{Substantive-logical meanings}
\label{sec:org71c0260}
