notes/Theory/ThoeryEdNotes.org
**** *Substantive-logical meanings*
     refer to the cognitive processes involved in dealing with the subject matter under study. Substantive-logical meanings are categorized under three generate headings:
     - _Analytic Process_:  Analytic statements are statements about the proposed use of language. Analytic statements are true by virtue of the meaning of the words of which the are composed (they are true /a priori/). Or in other words these are true by an agreed upon set of rules and inferences. Statements like "All single Men are Bachelors". The book describes several sub-classifications here are just a few:
       1. Defining-General (DEF) ::= To define in a general manner is to give the defining characteristic of a /class/ /and/ to give a specific example of an item within that class. DEF is also coded when the type of definition asked for or given is not clear. \\
          Examples:
          1. T: What is a barrier? Code: T/SOL/BAR/DEF/1/-/-/-
          2. P: It's something that hinders trade. Code: P/RES/BAR/DEF/2/-/-/-
       2. Defining-Denotative (DED) ::= To define denotatively is to refer to the objects to which the term is applicable. A denotative definition cites the objects to which the term may correctly be applied, and these objects constitute the denotation of the term. 
     - _Empirical Process_: Empirical statements give information about the world, based on one's experience of it. These statements are distinguished by tests that are conducted in reference to one's experience. Some Examples:
       1. Fact-Stating (FAC) ::= Giving an account, description or report on the current state of affairs. To State a fact is to state what is. Coding Example:
          1. T: Now in 1934 \ldots in 1934 \ldots who was President? Code: T/SOL/PFT/\textit{FAC}/2/-/-/-
          2. P: Roosevelt Code: P/RES/PFT/\textit{FAC}/1/-/-/-
       2. Explaining (XPL) ::= TO explain is to relate an object, event, action, or state of affairs to some other object, event, action, or state of affairs; or to show the relation between an event or state of affairs and a principle or generalization; or to state the relationships between principles or generalizations. For this document explanation and inference are taken to be identical. A statement is coded XPL when it concerns the /effect/ of some event or state of affairs on some other even or state of affairs; or when a statement provides /reasons/ for some event or state of affairs. Coding Examples:
          1. T: What would happen if we raised the tariff on transistor radios? Code: T/SOL/BAT/XPL/2/-/-/-
          2. P: Prices would go up. Code: P/RES/BAT/\textit{XPL}/1/-/-/-
     - _Evaluative Process_: Evaluative statements are statements of grade, praise, blame, condemnation, or criticism. I'm only going to show the OPN example, there is also a Justification example (JUS) in the book:
       1. Opining (OPN) ::= To make a statement of opinion, simply to opine. Includes statements of the nature: 1) What ought to be done or 2) fairness, worth, importance, or quality of an action, event, person, idea, plan, or policy. Coding Example:
          1. P: I think the farmer is being exploited. Code: P/REA/BAT/\textit{OPN}/1/-/-/-
**** *Instructional Meanings*
     These refer to conversations about classroom management, assignments, procedures etc. I'm going to omit these becasue they will not pertain to our explanatory objects and the book goes enumerates many of them in great detail.
**** *Instructional-Logical Meanings* 
     Meanings that include those processes listed under substantive-logical meanings, but also refer to distinctly didactic verbal moves such as those involved in positive or negative rating and giving instructions. These include statements of qualitative judgment. Its easier to understand with examples. There are many of these but I'll only explicate a few to get the point across:
     1. Positive (POS) \triangleq refers to distinctly affirmative rating, usually in a reaction to a statement.
        1. T: Right! Code: T/REA/TDI/-/-/STA/\textit{POS}/1
     2. Admitting (ADM) \triangleq Hesitation of part of rater, mildy accepting or equivocally positive rating usually in reaction to a statement.
        1. T: Mm-hmm. Code: T/REA/PFT/-/-/STA/\textit{ADM}/1
* Explaining and Explanations Typology 

** Keys
   An explanation is divided up into "keys":
   - Keys \triangleq A Key is part of the main explanation that must be explained for one to understand that which is to be explained
** Links
   One would then seek to "link" the discrete "keys" together: \\
   - Links :: PAPER DOES NOT DEFINE
** Rules
   One would also define any rules that are pertinent to what is being explained
   - Rules :: PAPER DOES NOT DEFINE
** The Typology 
   The Typology is formed by 3 categories of explanation:

*** The Interpretive
    That which clarifies, exemplifies, or interprets the meaning of terms. Roughly speaks to "What is ... ?" 
*** The Descriptive
    That which describes a process or structure. Speaks to "How is ..? How does ...?" 
*** The "Reason Giving"
    That which offers reasons or causes. Speaks to the occurrence of a phenomenon (Why is ...?) \\
    
*** An Example: 

**** Interpretive Explanations:
     - What are phyla?
     - What is a biome?
     - What is a fossil?
     - What is ecological succession?
      
**** Descriptive Explanations:
     - Where does the energy of the living world come from?
     - How do streams come to be polluted?
     - How do environmental factors influence the number of plants and animals in a particular way
     - How are animal protected against the dangers of drying out 
      
**** Reason-giving Explanations:
     - Why are there no polar bears in the South Pole
     - Why is soil considered to be an ecosystem 

   I think that these roughly translate to our "Levels" in our coding scheme. 

* Gage et al Typology
  N.L. Gage's main programme was to identify objective variables in teaching lectures that could be used to form a /standard/ approach to lecturing. He compares the thrust of his work to that of physics; when physics hit a theoretical limit they often sought to surpass the limit by expanding and individuating constituents. For example, the Nucleus of an Atom is actually made up of subatomic particles, then they would seek to study the subatomic particles instead of the nucleus. This typology follows from Barak Rosenshines work See Chapter 9, pg 201, Research into Classroom Processes Westbury/Bellack. In this article Rosenshine develops the typology and then runs a user study to assess the correlative impact of each category on effective and ineffective lectures. So the typology merely serves as a way to classify, and differentiate good lectures from bad ones. This paper is meh, it doesn't define everything but the results are good although it can be hard to follow at times, especially the distinction between variables and categories - which I still don't understand.

** Variables 
    Rosenshine identifies 27 variables that were verbal, non-verbal, communicated by teachers and received by students. The variables were developed from research in four general areas:
    1. Linguistics
    2. Instructional Set
    3. Experimental studies of instruction
    4. Multivariate Studies of the Behavioral Correlates of Teacher Effectiveness 

