notes/Theory/ThoeryEdNotes.tex
refer to the cognitive processes involved in dealing with the subject matter under study. Substantive-logical meanings are categorized under three generate headings:
\begin{itemize}
\item \uline{Analytic Process}:  Analytic statements are statements about the proposed use of language. Analytic statements are true by virtue of the meaning of the words of which the are composed (they are true \emph{a priori}). Or in other words these are true by an agreed upon set of rules and inferences. Statements like "All single Men are Bachelors". The book describes several sub-classifications here are just a few:
\begin{enumerate}
\item Defining-General (DEF) ::= To define in a general manner is to give the defining characteristic of a \emph{class} \emph{and} to give a specific example of an item within that class. DEF is also coded when the type of definition asked for or given is not clear. \\
Examples:
\begin{enumerate}
\item T: What is a barrier? Code: T/SOL/BAR/DEF/1/-/-/-
\item P: It's something that hinders trade. Code: P/RES/BAR/DEF/2/-/-/-
\end{enumerate}
\item Defining-Denotative (DED) ::= To define denotatively is to refer to the objects to which the term is applicable. A denotative definition cites the objects to which the term may correctly be applied, and these objects constitute the denotation of the term.
\end{enumerate}
\item \uline{Empirical Process}: Empirical statements give information about the world, based on one's experience of it. These statements are distinguished by tests that are conducted in reference to one's experience. Some Examples:
\begin{enumerate}
\item Fact-Stating (FAC) ::= Giving an account, description or report on the current state of affairs. To State a fact is to state what is. Coding Example:
\begin{enumerate}
\item T: Now in 1934 \ldots in 1934 \ldots who was President? Code: T/SOL/PFT/\textit{FAC}/2/-/-/-
\item P: Roosevelt Code: P/RES/PFT/\textit{FAC}/1/-/-/-
\end{enumerate}
\item Explaining (XPL) ::= TO explain is to relate an object, event, action, or state of affairs to some other object, event, action, or state of affairs; or to show the relation between an event or state of affairs and a principle or generalization; or to state the relationships between principles or generalizations. For this document explanation and inference are taken to be identical. A statement is coded XPL when it concerns the \emph{effect} of some event or state of affairs on some other even or state of affairs; or when a statement provides \emph{reasons} for some event or state of affairs. Coding Examples:
\begin{enumerate}
\item T: What would happen if we raised the tariff on transistor radios? Code: T/SOL/BAT/XPL/2/-/-/-
\item P: Prices would go up. Code: P/RES/BAT/\textit{XPL}/1/-/-/-
\end{enumerate}
\end{enumerate}
\item \uline{Evaluative Process}: Evaluative statements are statements of grade, praise, blame, condemnation, or criticism. I'm only going to show the OPN example, there is also a Justification example (JUS) in the book:
\begin{enumerate}
\item Opining (OPN) ::= To make a statement of opinion, simply to opine. Includes statements of the nature: 1) What ought to be done or 2) fairness, worth, importance, or quality of an action, event, person, idea, plan, or policy. Coding Example:
\begin{enumerate}
\item P: I think the farmer is being exploited. Code: P/REA/BAT/\textit{OPN}/1/-/-/-
\end{enumerate}
\end{enumerate}
\end{itemize}
\item \textbf{Instructional Meanings}
\label{sec:org0432f8b}
These refer to conversations about classroom management, assignments, procedures etc. I'm going to omit these becasue they will not pertain to our explanatory objects and the book goes enumerates many of them in great detail.
\item \textbf{Instructional-Logical Meanings}
\label{sec:orge7c1662}
Meanings that include those processes listed under substantive-logical meanings, but also refer to distinctly didactic verbal moves such as those involved in positive or negative rating and giving instructions. These include statements of qualitative judgment. Its easier to understand with examples. There are many of these but I'll only explicate a few to get the point across:
\begin{enumerate}
\item Positive (POS) \(\triangleq\) refers to distinctly affirmative rating, usually in a reaction to a statement.
\begin{enumerate}
\item T: Right! Code: T/REA/TDI/-/-/STA/\textit{POS}/1
\end{enumerate}
\item Admitting (ADM) \(\triangleq\) Hesitation of part of rater, mildy accepting or equivocally positive rating usually in reaction to a statement.
\begin{enumerate}
\item T: Mm-hmm. Code: T/REA/PFT/-/-/STA/\textit{ADM}/1
\end{enumerate}
\end{enumerate}
\end{itemize}
\section*{Explaining and Explanations Typology}
\label{sec:org894f2f1}

\subsection*{Keys}
\label{sec:orgc7a3098}
An explanation is divided up into "keys":
\begin{itemize}
\item Keys \(\triangleq\) A Key is part of the main explanation that must be explained for one to understand that which is to be explained
\end{itemize}
\subsection*{Links}
\label{sec:org7c18127}
One would then seek to "link" the discrete "keys" together: \\
\begin{description}
\item[{Links}] PAPER DOES NOT DEFINE
\end{description}
\subsection*{Rules}
\label{sec:orgc756ae1}
One would also define any rules that are pertinent to what is being explained
\begin{description}
\item[{Rules}] PAPER DOES NOT DEFINE
\end{description}
\subsection*{The Typology}
\label{sec:orgfb19bca}
The Typology is formed by 3 categories of explanation:

\subsubsection*{The Interpretive}
\label{sec:orgc57a80c}
That which clarifies, exemplifies, or interprets the meaning of terms. Roughly speaks to "What is \ldots{} ?" 
\subsubsection*{The Descriptive}
\label{sec:org6e9fa60}
That which describes a process or structure. Speaks to "How is ..? How does \ldots{}?" 
\subsubsection*{The "Reason Giving"}
\label{sec:org4096af0}
That which offers reasons or causes. Speaks to the occurrence of a phenomenon (Why is \ldots{}?) \\

\subsubsection*{An Example:}
\label{sec:orgbc109fb}

\begin{itemize}
\item Interpretive Explanations:
\label{sec:orgf509a5f}
\begin{itemize}
\item What are phyla?
\item What is a biome?
\item What is a fossil?
\item What is ecological succession?
\end{itemize}

\item Descriptive Explanations:
\label{sec:org97ed69c}
\begin{itemize}
\item Where does the energy of the living world come from?
\item How do streams come to be polluted?
\item How do environmental factors influence the number of plants and animals in a particular way
\item How are animal protected against the dangers of drying out
\end{itemize}

\item Reason-giving Explanations:
\label{sec:org36b0280}
\begin{itemize}
\item Why are there no polar bears in the South Pole
\item Why is soil considered to be an ecosystem
\end{itemize}

I think that these roughly translate to our "Levels" in our coding scheme.
\end{itemize}

\section*{Gage et al Typology}
\label{sec:org0fc7955}
N.L. Gage's main programme was to identify objective variables in teaching lectures that could be used to form a \emph{standard} approach to lecturing. He compares the thrust of his work to that of physics; when physics hit a theoretical limit they often sought to surpass the limit by expanding and individuating constituents. For example, the Nucleus of an Atom is actually made up of subatomic particles, then they would seek to study the subatomic particles instead of the nucleus. This typology follows from Barak Rosenshines work See Chapter 9, pg 201, Research into Classroom Processes Westbury/Bellack. In this article Rosenshine develops the typology and then runs a user study to assess the correlative impact of each category on effective and ineffective lectures. So the typology merely serves as a way to classify, and differentiate good lectures from bad ones. This paper is meh, it doesn't define everything but the results are good although it can be hard to follow at times, especially the distinction between variables and categories - which I still don't understand.

\subsection*{Variables}
\label{sec:org6e10264}
Rosenshine identifies 27 variables that were verbal, non-verbal, communicated by teachers and received by students. The variables were developed from research in four general areas:
\begin{enumerate}
\item Linguistics
\item Instructional Set
\item Experimental studies of instruction
\item Multivariate Studies of the Behavioral Correlates of Teacher Effectiveness
\end{enumerate}
