notes/Theory/ThoeryEdNotes.org
*** Linguistic Categories
    Consists of 9 "categories"
    1. Word Length
    2. Total number of relevant words
    3. Length and structure of independent clause unit
    4. prepositional phrases
    5. readability estimate \triangleq based on a multiple-regression formula developed by Flesch
    6. personal references \triangleq counts of first and second person pronouns
    7. negative sentences \triangleq counts of sentences containing "not" modifying the verb, noun or some similar negation
    8. passive verbs \triangleq counts of independent or dependent clauses containing passive verbs
    9. awkward and fragmented sentences \triangleq counts of sentences which depart from usual sentence construction or phrases which lack a subject of a verb but add information. e.g. "Now to foreign affairs" 
*** Instructional Set
    Consists of 2 categories
    1. Structuring Sets \triangleq set that contains variables which are words or phrases which indicate that the speaker is attempting to clarify distinctions between new and previously learned material
    2. Focusing or Arousing Sets \triangleq set that contains variables which might identify phrases designed to arouse or focus attention.  
*** Presentational Categories
    Consists of 9 categories
    1. Use of rule-and-example Pattern
    2. number of examples
    3. organization of topics
    4. use of enumeration
    5. movement and gesture
    6. breaks in speech
    7. use of maps and chalkboard
    8. rate of speech
    9. repetition and redundancy  
*** Multivariate studies of teaching behaviors
    Consists of 7 categories
    1. Verbal Hostility
    2. non-verbal affect
    3. reference to pupil's interests
    4. expansion of pupil's ideas
    5. ratio of acceptance and praise to criticism
    6. Conditional Words \triangleq counts of words such as "but", "however" and "although"
    7. Explaining Links \triangleq prepositions and conjunctions which indicated the cause, result, means, or purposes of an event or idea.  

** Takeaway
   We could co-opt a lot of rosenshines typology for our typology, a benefit of this would be that we would be in a position to co-opt his/her research on effective lectures to effective powerpoints/papers for algorithms.


bibliographystyle:unsrt
bibliography:TheoryEdNotes.bib
