notes/Theory/ThoeryEdNotes.tex

\subsubsection*{Linguistic Categories}
\label{sec:org3d7f4fa}
Consists of 9 "categories"
\begin{enumerate}
\item Word Length
\item Total number of relevant words
\item Length and structure of independent clause unit
\item prepositional phrases
\item readability estimate \(\triangleq\) based on a multiple-regression formula developed by Flesch
\item personal references \(\triangleq\) counts of first and second person pronouns
\item negative sentences \(\triangleq\) counts of sentences containing "not" modifying the verb, noun or some similar negation
\item passive verbs \(\triangleq\) counts of independent or dependent clauses containing passive verbs
\item awkward and fragmented sentences \(\triangleq\) counts of sentences which depart from usual sentence construction or phrases which lack a subject of a verb but add information. e.g. "Now to foreign affairs"
\end{enumerate}
\subsubsection*{Instructional Set}
\label{sec:org13b904d}
Consists of 2 categories
\begin{enumerate}
\item Structuring Sets \(\triangleq\) set that contains variables which are words or phrases which indicate that the speaker is attempting to clarify distinctions between new and previously learned material
\item Focusing or Arousing Sets \(\triangleq\) set that contains variables which might identify phrases designed to arouse or focus attention.
\end{enumerate}
\subsubsection*{Presentational Categories}
\label{sec:orgfee2088}
Consists of 9 categories
\begin{enumerate}
\item Use of rule-and-example Pattern
\item number of examples
\item organization of topics
\item use of enumeration
\item movement and gesture
\item breaks in speech
\item use of maps and chalkboard
\item rate of speech
\item repetition and redundancy
\end{enumerate}
\subsubsection*{Multivariate studies of teaching behaviors}
\label{sec:orgecd5873}
Consists of 7 categories
\begin{enumerate}
\item Verbal Hostility
\item non-verbal affect
\item reference to pupil's interests
\item expansion of pupil's ideas
\item ratio of acceptance and praise to criticism
\item Conditional Words \(\triangleq\) counts of words such as "but", "however" and "although"
\item Explaining Links \(\triangleq\) prepositions and conjunctions which indicated the cause, result, means, or purposes of an event or idea.
\end{enumerate}

\subsection*{Takeaway}
\label{sec:org71f65e5}
We could co-opt a lot of rosenshines typology for our typology, a benefit of this would be that we would be in a position to co-opt his/her research on effective lectures to effective powerpoints/papers for algorithms.


bibliographystyle:unsrt
bibliography:TheoryEdNotes.bib
\end{document}